# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'brave-browser'
cask 'hyperkey'
cask 'raycast'
cask 'docker'
cask 'figma'
cask 'google-chrome'
cask 'shottr'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'reflex'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'cursor'
cask 'warp'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497

